posts/2016-06-06-teach-me-to-sing.org
#+date: <2016-06-06>
#+filetags: prayer religion
#+title: Teach Me to Sing

Voice of Heaven,

Words become thoughts,\\
thoughts, beliefs,\\
and beliefs, actions;\\
and that which I\\
once merely heard\\
is soon that which I am.

So, help me ignore\\
the voices that inspire\\
hatred and misery,\\
distress and malice,\\
selfishness and fear,

May I again hear the\\
words of love and joy,\\
peace and kindness,\\
generosity and hope;

And by hearing,\\
learn to speak,\\
and by speaking,\\
learn to sing with the\\
Father, Son, and Spirit.

Three distinct voices,\\
in one beautiful song.

/Amen/


#+begin_tagline
Tagged: prayer religion
#+end_tagline
