docs/posts/2016-06-06-teach-me-to-sing.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 30, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Teach Me to Sing</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Teach Me to Sing</h1>
<p class="subtitle" role="doc-subtitle">Jun 06, 2016</p>
</header><p>
Voice of Heaven,
</p>

<p>
Words become thoughts,<br>
thoughts, beliefs,<br>
and beliefs, actions;<br>
and that which I<br>
once merely heard<br>
is soon that which I am.
</p>

<p>
So, help me ignore<br>
the voices that inspire<br>
hatred and misery,<br>
distress and malice,<br>
selfishness and fear,
</p>

<p>
May I again hear the<br>
words of love and joy,<br>
peace and kindness,<br>
generosity and hope;
</p>

<p>
And by hearing,<br>
learn to speak,<br>
and by speaking,<br>
learn to sing with the<br>
Father, Son, and Spirit.
</p>

<p>
Three distinct voices,<br>
in one beautiful song.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org899e963">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 30, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
